import pandas as pd
import numpy as np
from random import randint
from object3_1 import object
import time
import matplotlib.pyplot as plt


# 读取区域需求量
demand_i = pd.read_csv('F:/bikedata/bike_datas/test/zone_day.csv')
# 读取区域包含的站点信息
zone_i = pd.read_csv('F:/bikedata/bike_datas/station_datas.csv').rename(
    columns={'station_id': 'id', 'zone_id': 'zone'})[['id', 'zone']]
# 读取站点信息
stations_i = pd.read_csv('F:/bikedata/bike_datas/station_datas.csv')[['station_id', 'capacity']].\
    rename(columns={'station_id': 'id'})
# demand_i['start'] = round(demand_i['start'] * 0.5)
# demand_i['end'] = round(demand_i['end'] * 0.5)


def main(demand, zone, stations, day):
    # 构建新站点
    new_zone = pd.DataFrame()
    new_stations = pd.DataFrame()
    # 新站点构建
    new_zone['zone'] = zone.drop(zone[zone[['zone']].duplicated()].index, axis=0)['zone']
    new_zone['id'] = new_zone['zone'].apply(lambda x: int(str(x)[::]))
    new_stations['id'] = new_zone['id']
    new_stations['capacity_up'] = 60
    new_stations['capacity'] = 60
    # 新站点分割线
    object_list, bikes_list, capacity_list, bikes_best_list, capacity_best_list = [], [], [], [], []
    best_gap, best_start_demands, best_end_demands, best_bikes, best_capacity = 10000000, 0, 0, 10000000, 10000000
    best_object = ()
    new_stations_best = new_stations.copy()
    stations_i = pd.concat([stations, new_stations])  # 加入新站点
    zone_i = pd.concat([new_zone, zone], sort=True)  # 加入新站点
    zone_count_stations = zone_i.groupby(['zone'])['id'].count().reset_index()  # 统计每个区域的站点数量
    demand_i = pd.merge(demand, zone_count_stations, how='left', on='zone').rename(columns={'id': 'count_stations'})
    stations_i['bikes'] = round(stations_i['capacity'] * 0.5)  # 设置车子数量
    stations_i = stations_i.set_index('id')


    for time_i in range(100):
        # 加入新站点
        # stations_i['bikes'] = round(stations_i['capacity'] * 0.6)  # 设置车子数量
        # stations_i['bikes'] = stations_i['capacity'].apply(lambda x: x * randint(4, 7)/10)  # 设置车子数量
        # stations_i['bikes'] = stations_i['capacity'].apply(lambda x: round(x * randint(2, 9)/10))  # 设置车子数量
        gap, start_demands, end_demands = object(time_i, demand_i, zone_i, stations_i, day)
        bikes = stations_i['bikes'].sum()
        object_i = (gap, start_demands, end_demands, bikes)
        object_list.append(object_i)
        # 加入算法
        random_num = randint(0, 100)
        t = False
        if best_start_demands < start_demands or best_end_demands < end_demands:
            best_gap, best_start_demands, best_end_demands, best_bikes = gap, start_demands, end_demands, bikes
            best_object = object_i
            new_stations_best = stations_i.copy()
            t = True

        # if best_bikes > bikes and best_capacity > capacity:
        #     best_bikes, best_capacity = bikes, capacity
        #     best_object = object_i
        #     new_stations_best = new_stations.copy()
        #     t = True
        if t is False and random_num <= 10:
            stations_i['bikes'] = stations_i['capacity'].apply(lambda x: round(x * randint(0, 100) / 100))
        else:
            stations_i['bikes'] = new_stations_best['bikes'].apply(lambda x: round(x * randint(90, 110) / 100))
        print(best_object)

        bikes_list.append(bikes)
        bikes_best_list.append(best_bikes)
    new_stations_best.to_csv('./best_stations.csv', index=None)
    return object_list, bikes_list, bikes_best_list

start_time = time.time()
object_list, bikes_list, bikes_best_list = main(demand_i, zone_i, stations_i, 10)
end_time = time.time()
print(object_list)
print('用时：%s s' % round(end_time - start_time))
print('原站点求可以满足的最大需求量10d,100轮')
# print('原站点求可以满足的最大需求量')

def DrawLinechart(y1, y2, title):
    x = range(len(y1))  # 生成0-10
    plt.plot(x, y1, c="R", label='common')
    plt.plot(x, y2, c='B', label='best')
    plt.legend(loc='upper left')#图例的位置是左上
    plt.xlabel('round')#X轴标签
    plt.ylabel('value')#Y轴标签
    plt.title(title)#折线图标题

    plt.show()
# DrawLinechart(bikes_list, bikes_best_list, 'bikes')
DrawLinechart(bikes_list, bikes_best_list, 'bikes')

# 在容量固定的情况下，看可以满足的最大需求量

# 分配比例一致 10day
# 原站点 车子0.5   [(21122.0, 273903.0, 274335.0, 12742.0)]
# 新站点 上限60 车子0.5  [(23406.0, 288365.0, 288547.0, 24112.0)  用时：298 s][(23472.0, 289096.0, 289208.0, 24112.0)用时：280 s][(23471.0, 288895.0, 289012.0, 24112.0)用时：287 s]
# 分配比例不一样 10day
# 原站点 车子0.5 [(48227.0, 246158.0, 246433.0, 12742.0) 542 s]
# 新站点 上限60 车子0.5  ([(87738.0, 254562.0, 254520.0, 24112.0) 500 s]
# 分配比例不一样  31day
# 原站点 车子0.5 [(65900.0, 1068871.0, 1069669.0, 12742.0)10048 s]
# 新站点 上限60 车子0.5  [(72361.0, 1123740.0, 1124433.0, 24112.0)6728 s]



# 加入算法  10day  100轮
# 原站点 车子0.5  (21219.0, 274810.0, 275241.0, 12696)
#[(21095.0, 273693.0, 274112.0, 12742.0), (21080.0, 273616.0, 274018.0, 12739), (21084.0, 273287.0, 273707.0, 12756), (21098.0, 273643.0, 274087.0, 12691), (21130.0, 273661.0, 274073.0, 12761), (21091.0, 273494.0, 273885.0, 12702), (21045.0, 273233.0, 273690.0, 12712), (21100.0, 273418.0, 273806.0, 12749), (21081.0, 273764.0, 274159.0, 12781), (21070.0, 273473.0, 273869.0, 12792), (21123.0, 273922.0, 274305.0, 12784), (21158.0, 274062.0, 274474.0, 12763), (21155.0, 273695.0, 274102.0, 12723), (21145.0, 273666.0, 274097.0, 12735), (21124.0, 273899.0, 274287.0, 12727), (21108.0, 273601.0, 274029.0, 12765), (21124.0, 274062.0, 274456.0, 12769), (21122.0, 273968.0, 274400.0, 12780), (21169.0, 274081.0, 274528.0, 12731), (21153.0, 274277.0, 274706.0, 12742), (21174.0, 274303.0, 274749.0, 12768), (21177.0, 274088.0, 274521.0, 12781), (21170.0, 274332.0, 274764.0, 12733), (21146.0, 273968.0, 274420.0, 12719), (21173.0, 274036.0, 274449.0, 12762), (21147.0, 273756.0, 274179.0, 12697), (21179.0, 274071.0, 274460.0, 12753), (21181.0, 274724.0, 275173.0, 12653), (21193.0, 274229.0, 274706.0, 12607), (20642.0, 270882.0, 271392.0, 12516), (21175.0, 274214.0, 274651.0, 12691), (21147.0, 274300.0, 274781.0, 12698), (21225.0, 274300.0, 274771.0, 12625), (21177.0, 274127.0, 274558.0, 12658), (21180.0, 274086.0, 274580.0, 12599), (21183.0, 274066.0, 274521.0, 12661), (21165.0, 274056.0, 274513.0, 12666), (21176.0, 274403.0, 274845.0, 12615), (21168.0, 274015.0, 274459.0, 12667), (21125.0, 273937.0, 274364.0, 12676), (21128.0, 274027.0, 274519.0, 12593), (21181.0, 274141.0, 274596.0, 12633), (21194.0, 274204.0, 274642.0, 12712), (21188.0, 274188.0, 274664.0, 12638), (21194.0, 274289.0, 274787.0, 12614), (21117.0, 273562.0, 273985.0, 12653), (21196.0, 274283.0, 274727.0, 12667), (21166.0, 274101.0, 274541.0, 12688), (21131.0, 274020.0, 274515.0, 12681), (21146.0, 273890.0, 274304.0, 12671), (21163.0, 274256.0, 274713.0, 12674), (21175.0, 274215.0, 274698.0, 12642), (21181.0, 274136.0, 274581.0, 12667), (21164.0, 274071.0, 274505.0, 12657), (21138.0, 273634.0, 274114.0, 12621), (21187.0, 274507.0, 274972.0, 12643), (21197.0, 273806.0, 274257.0, 12660), (21132.0, 273924.0, 274380.0, 12648), (21176.0, 273735.0, 274181.0, 12669), (21174.0, 273976.0, 274384.0, 12676), (21202.0, 274180.0, 274648.0, 12661), (21180.0, 274316.0, 274784.0, 12615), (20631.0, 269477.0, 269628.0, 12930), (21219.0, 274810.0, 275241.0, 12696), (21134.0, 274158.0, 274630.0, 12677), (21153.0, 273753.0, 274170.0, 12708), (21190.0, 274418.0, 274840.0, 12712), (21193.0, 274148.0, 274551.0, 12707), (21161.0, 274203.0, 274666.0, 12702), (20530.0, 268336.0, 268740.0, 12533), (21166.0, 274515.0, 274921.0, 12786), (21140.0, 273658.0, 274068.0, 12686), (21219.0, 274508.0, 274955.0, 12627), (21207.0, 274421.0, 274856.0, 12690), (21198.0, 274310.0, 274722.0, 12710), (21202.0, 274229.0, 274647.0, 12702), (21186.0, 274151.0, 274559.0, 12718), (21222.0, 274274.0, 274678.0, 12678), (21189.0, 274006.0, 274437.0, 12699), (21192.0, 274230.0, 274650.0, 12666), (21192.0, 274252.0, 274684.0, 12706), (21155.0, 274363.0, 274776.0, 12703), (21178.0, 274533.0, 274967.0, 12666), (21143.0, 273834.0, 274263.0, 12720), (21179.0, 274093.0, 274532.0, 12683), (20382.0, 269023.0, 269589.0, 12320), (21176.0, 274026.0, 274448.0, 12691), (21165.0, 274306.0, 274751.0, 12709), (21189.0, 274454.0, 274887.0, 12679), (20531.0, 268859.0, 269202.0, 12793), (20240.0, 265737.0, 265969.0, 12867), (21196.0, 274200.0, 274630.0, 12710), (21186.0, 274648.0, 275052.0, 12718), (21192.0, 274590.0, 275008.0, 12675), (21131.0, 274154.0, 274579.0, 12696), (21186.0, 274225.0, 274641.0, 12712), (20495.0, 269586.0, 269723.0, 13020), (21183.0, 274025.0, 274450.0, 12708), (20557.0, 269895.0, 270300.0, 12628), (21171.0, 274018.0, 274457.0, 12730)]

# 新站点 上限60 车子0.5



# 新站点 上限60 车子0.5 [(12438.0, 135112.0, 135162.0)] [(12400.0, 134913.0, 134963.0)] [(12419.0, 135075.0, 135102.0)] [(12500.0, 135557.0, 135501.0)]
# 原站点 车子0.5  5day [(11539.0, 128367.0, 128404.0)]




# 修改为最大满足需求量的目标函数

# 开始结束需求量分配比例一致
# 所有站点初始比例 0.5 / day5  12754.0 136985.0 136983.0/12776.0 136985.0 136983.0/12756.0 136985.0 136983.0/12746.0 136985.0 136983.0/12766.0 136985.0 136983.0
# 所有站点初始比例 0.6 / day5  12770.0 136985.0 136983.0/12764.0 136985.0 136983.0/12780.0 136985.0 136983.0/12764.0 136985.0 136983.0
# 所有站点初始比例 0.4-0.6 / day5  12750.0 136985.0 136983.0/12756.0 136985.0 136983.0/12760.0 136985.0 136983.0/12764.0 136985.0 136983.0
# 所有站点初始比例 0.2-0.8 / day5  12770.0 136985.0 136983.0/12770.0 136985.0 136983.0/12633.0 136723.0 136588.0/12762.0 136985.0 136983.0

# 原站点 初始比例 0.5 / day5  11820.0 130692.0 130586.0/11806.0 130692.0 130586.0/11808.0 130692.0 130586.0/11816.0 130692.0 130586.0/11788.0 130692.0 130586.0/11810.0 130692.0 130586.0
# 原站点 初始比例 0.6 / day5  11822.0 130692.0 130586.0/11806.0 130692.0 130586.0/11808.0 130692.0 130586.0/11804.0 130692.0 130586.0
# 所有站点初始比例 0.4-0.6 / day5  11808.0 130692.0 130586.0/11812.0 130692.0 130586.0/11814.0 130692.0 130586.0






#  开始结束需求量分配比例不同
# 所有站点初始比例 0.5 / day5  40670.0 114765.0 114851.0/42953.0 113712.0 113813.0/41784.0 115108.0 115020.0/40687.0 111665.0 111634.0/39514.0 110371.0 110331.0


# 原站点/初始车子比例 0.5/不断改变需求量无法分配的站点初始比例/day1  2554.0 30228.0 30228.0 / 2564.0 30228.0 30228.0 / 2556.0 30228.0 30228.0
# 原站点/初始车子比例 0.5/不断改变需求量无法分配的站点初始比例/day1-2  4569.0 48228.0 48227.0 / 4577.0 48228.0 48227.0/4575.0 48228.0 48227.0
